In [1]:
#Week 5-2  - Data Transformation


#pandas fill values and functions

#Use this data:

state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}


import pandas as pd
import numpy as np
#state_data =  {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}
state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}
print(state_data)

{'State': ['Alabama', 'Alaska', 'Arizona', 'Arkansas'], 'PostCode': ['AL', 'AK', 'AZ', 'AR'], 'Area': ['52,423', '656,424', '*', '53,182'], 'Pop': ['4,040,587', '550,043', '3,665,228', '2,350,750']}

In [2]:
stdf = pd.DataFrame(state_data,columns=['State','PostCode','Area','Pop'])

print(stdf)

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [3]:
stdf = stdf.set_index('State')
stdf =stdf.replace('*','0')

print(stdf)

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        0  3,665,228
Arkansas       AR   53,182  2,350,750

In [4]:
def comma_rep(x):
    stdf[x] = stdf[x].str.replace(",","").astype(float)
    
comma_rep("Area")


print(stdf)

         PostCode      Area        Pop
State
Alabama        AL   52423.0  4,040,587
Alaska         AK  656424.0    550,043
Arizona        AZ       0.0  3,665,228
Arkansas       AR   53182.0  2,350,750

In [5]:
comma_rep("Pop")
print(stdf)

         PostCode      Area        Pop
State
Alabama        AL   52423.0  4040587.0
Alaska         AK  656424.0   550043.0
Arizona        AZ       0.0  3665228.0
Arkansas       AR   53182.0  2350750.0

Week 5-3 - Data Stacking and Unstacking

Sometimes a need to change how we look at a table of data

persondict = {'person':['Bob','Alice','Steve'],'age':[32,24,64],'weight':[128,86,95]}


There are packages and spreadsheets that support this data transformation, such as miniTab and Excel.  In pandas, we can use the stack, unstack, and pivot functions.

An important point about this data transformation is that it changes the unit of analysis.  

Let's look at an example.

In [6]:


import pandas as pd
persondict = {'person':['Bob','Alice','Steve'], 'age':[32, 24, 64], 'weight':[128, 86, 95]}
persontable = pd.DataFrame(persondict, columns=['person','age','weight'])
persontable

#We use the person column as the index to the table, and now we have the wide format.
persontable = persontable.set_index('person')
persontable

        age  weight
person
Bob      32     128
Alice    24      86
Steve    64      95

In [10]:
result = persontable.stack()

print(result)
result.shape

person
Bob     age        32
        weight    128
Alice   age        24
        weight     86
Steve   age        64
        weight     95
dtype: int64

(6,)

In [13]:
persontall = result.reset_index()
persontall.columns=["person","attribute","value"]

persontall

  person attribute  value
0    Bob       age     32
1    Bob    weight    128
2  Alice       age     24
3  Alice    weight     86
4  Steve       age     64
5  Steve    weight     95

In [17]:
persontall.pivot('person','attribute','value')

attribute  age  weight
person
Alice       24      86
Bob         32     128
Steve       64      95